Revit 2024 API
PlasticVinyl.PlasticvinylPattern Property
 The property labeled "Relief Pattern" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string PlasticvinylPattern { get; }
Visual Basic
Public Shared ReadOnly Property PlasticvinylPattern As String
	Get
Visual C++
public:
static property String^ PlasticvinylPattern {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylPatternType".
See Also
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace